<?php
    echo 'abs(10) = ' . abs(10) . '     abs(-10) = ' . abs(-10) . "\n";// abs модуль числа
    echo 'round(10.50) = ' . round(10.50) . '     round(10.49) = ' . round(10.49) . "\n";// round округление числа
    echo 'ceil(10.50) = ' . ceil(10.50) . '     ceil(10.49) = ' . ceil(10.49) . "\n";// ceil округление числа в большую сторону
    echo 'floor(10.50) = ' . floor(10.50) . '     floor(10.49) = ' . floor(10.49) . "\n";// floor округление числа в меньшую сторону
    echo rand(0,10) . "\n";// rand случайное число в диапазоне
    echo min(0,10, -10, 55) . "\n";
    echo max(0,10, -10, 55) . "\n";
?>